families = {
    'Сидоров Никита': 35,
    'Сидоров Павел': 10,
    'Сидорова Алина': 34,
    'Петров Василий': 5,
    'Петрова Мария': 25,
    'Петров Иван': 30,
    'Шевченко Дмитрий': 36,
    'Шевченко Наталья': 33,
    'Мостовой Федор': 30,
    'Мостовая Елена': 25,
    'Сидоренко Людмила': 29,
    'Сидоренко Петр': 35,
    'Петросян Евгений': 80,
    'Петросян Наталья': 75,
    'Шевчук Юрий': 64,
    'Кравченко Евгений': 33,
    'Кравчук Василий': 25,
    'Петровский Иван': 28,
    'Петровская Дарья': 25,
    'Сидоровский Михаил': 34,
    'Петренко Владимир': 22
}
request = input('Введите фамилию: ').title()

for key, value in families.items():
    surname, name = key.split()
    if len(request) - len(surname) == 1:
        request = request[:-1]

    else:
        request = request

    if request in surname:
        print(key, '', value)
